<a href="https://colab.research.google.com/github/Dummy-Bug/AI-and-ML/blob/master/sort_values_and_sort_index.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
import pandas as pd
import numpy as  np

https://realpython.com/pandas-sort-python/

In [7]:
df = pd.DataFrame({
    'col4': ['A', 'A', 'B', np.nan, 'D', 'C'],
    'col2': [2, 1, 9, 8, 7, 4],
    'col3': [0, 1, 9, 4, 2, 3],
    'col1': ['a', 'B', 'c', 'D', 'e', 'F']
})
df.head()

  col4  col2  col3 col1
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e

In [8]:
df.sort_values(by = ['col1'],axis= 0) # re-ordering the rows.

  col4  col2  col3 col1
1    A     1     1    B
3  NaN     8     4    D
5    C     4     3    F
0    A     2     0    a
2    B     9     9    c
4    D     7     2    e

In [9]:
df.sort_index(axis=1) # re-ordering the columns

  col1  col2  col3 col4
0    a     2     0    A
1    B     1     1    A
2    c     9     9    B
3    D     8     4  NaN
4    e     7     2    D
5    F     4     3    C